namespace Core.Model;

public static class StatusProvider
{
    private static List<Status> _statuses = new()
    {
        new (1, "Відправник самостійно створив цю накладну, але ще не надав до відправки"),
        new (2, "Видалено"),
        new (3, "Номер не знайдено"),
        new (4, "Відправлення у місті ХХXХ. (Статус для межобластных отправлений)"),
        new (41, "Відправлення у місті ХХXХ. (Статус для услуг локал стандарт и локал экспресс - доставка в пределах города)"),
        new (5, "Відправлення прямує до міста YYYY"),
        new (6, "Відправлення у місті YYYY, орієнтовна доставка..."),
        new (7, "Прибув на відділення"),
        new (8, "Прибув на відділення (завантажено в Поштомат)"),
        new (9, "Відправлення отримано"),
        new (10, "Відправлення отримано %DateReceived%. Протягом доби..."),
        new (11, "Відправлення отримано %DateReceived%. Грошовий переказ видано одержувачу."),
        new (12, "Нова Пошта комплектує ваше відправлення"),
        new (101, "На шляху до одержувача"),
        new (102, "Відмова від отримання"),
        new (103, "Відмова одержувача"),
        new (104, "Змінено адресу"),
        new (105, "Припинено зберігання"),
        new (106, "Одержано і створено ЄН зворотньої доставки"),
        new (111, "Невдала спроба доставки через відсутність Одержувача на адресі або зв'язок з ним"),
        new (112, "Дата доставки перенесена Одержувачем"),
        new (0, "Статус не визначено") 
    };

    public static List<Status> GetStatuses()
    {
        return _statuses;
    }
}